print('Task 6', end='\n\n')

# Выведите значения у для х в пределах от 0 до 100 c шагом 1 если y = 3x + 12

x = 0
# ваш код

while x >= 0 and x < 100:
    y = 3*x+12
    print(y)
    x+=1
    