print('Task 6', end='\n\n')
# Сортировка и слайсы.

# В цикле пока пользователь не введет Q 
# запрашивайте Фамилии игроков. 
# Сложите их в лист. 
# Отсортируйте лист используя втсроенную функцию. 
# Выведите на экран получившийся список.

# Теперь пройдитесь циклом по списку и выведите
# Абрам играет с Яков
# Борис играет м Эдик 
# (первый с последним, второй с предпоследним)